# TilePatternGridUnitX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TilePatternGridUnitX Property
ParameterTypeId Class See Also
---
"Horizontal spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TilePatternGridUnitX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TilePatternGridUnitX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TilePatternGridUnitX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace